<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ScheduleTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('schedules')->truncate();

        DB::table('schedules')->insert([
            [
                'id' => 1,
                'lesson' => 'Украинский язык',
                'start' => '09:00:00',
                'end' => '10:35:00',
                'week' => 1,
                'day' => 1
            ],
            [
                'id' => 2,
                'lesson' => 'Латынь',
                'start' => '10:50:00',
                'end' => '12:25:00',
                'week' => 1,
                'day' => 1
            ],
            [
                'id' => 3,
                'lesson' => 'Иностранный язык за ПС',
                'start' => '12:40:00',
                'end' => '14:15:00',
                'week' => 1,
                'day' => 1
            ],
            [
                'id' => 4,
                'lesson' => 'Физкультура',
                'start' => '15:00:00',
                'end' => '16:35:00',
                'week' => 1,
                'day' => 1
            ],
            [
                'id' => 5,
                'lesson' => 'Мед. Химия',
                'start' => '10:50:00',
                'end' => '13:15:00',
                'week' => 1,
                'day' => 2
            ],
            [
                'id' => 6,
                'lesson' => 'История Украины',
                'start' => '14:30:00',
                'end' => '16:05:00',
                'week' => 1,
                'day' => 2
            ],
            [
                'id' => 7,
                'lesson' => 'История Украины',
                'start' => '16:10:00',
                'end' => '17:45:00',
                'week' => 1,
                'day' => 2
            ],
            [
                'id' => 8,
                'lesson' => 'Гистология',
                'start' => '09:00:00',
                'end' => '10:35:00',
                'week' => 1,
                'day' => 3
            ],
            [
                'id' => 9,
                'lesson' => 'Анатомия',
                'start' => '10:50:00',
                'end' => '13:15:00',
                'week' => 1,
                'day' => 3
            ],
            [
                'id' => 10,
                'lesson' => 'Мед. Биология',
                'start' => '14:30:00',
                'end' => '16:05:00',
                'week' => 1,
                'day' => 3
            ],
            [
                'id' => 11,
                'lesson' => 'Иностранный язык',
                'start' => '09:00:00',
                'end' => '10:35:00',
                'week' => 1,
                'day' => 4
            ],
            [
                'id' => 12,
                'lesson' => 'Биофизика',
                'start' => '10:50:00',
                'end' => '12:25:00',
                'week' => 1,
                'day' => 4
            ],
            [
                'id' => 13,
                'lesson' => 'Мед. Биология',
                'start' => '12:40:00',
                'end' => '14:15:00',
                'week' => 1,
                'day' => 4
            ],
            [
                'id' => 14,
                'lesson' => 'Анатомия',
                'start' => '14:30:00',
                'end' => '16:05:00',
                'week' => 1,
                'day' => 4
            ],
            [
                'id' => 15,
                'lesson' => 'Анатомия',
                'start' => '16:20:00',
                'end' => '17:55:00',
                'week' => 1,
                'day' => 4
            ],
            [
                'id' => 16,
                'lesson' => 'Гистология',
                'start' => '13:30:00',
                'end' => '15:55:00',
                'week' => 1,
                'day' => 5
            ],
            [
                'id' => 17,
                'lesson' => 'Украинский язык',
                'start' => '09:00:00',
                'end' => '10:35:00',
                'week' => 2,
                'day' => 1
            ],
            [
                'id' => 18,
                'lesson' => 'Латынь',
                'start' => '10:50:00',
                'end' => '12:25:00',
                'week' => 2,
                'day' => 1
            ],
            [
                'id' => 19,
                'lesson' => 'Мед. Химия',
                'start' => '10:50:00',
                'end' => '12:25:00',
                'week' => 2,
                'day' => 2
            ],
            [
                'id' => 20,
                'lesson' => 'БЖД',
                'start' => '14:30:00',
                'end' => '16:05:00',
                'week' => 2,
                'day' => 2
            ],
            [
                'id' => 21,
                'lesson' => 'БЖД',
                'start' => '16:10:00',
                'end' => '17:45:00',
                'week' => 2,
                'day' => 2
            ],
            [
                'id' => 22,
                'lesson' => 'Биофизика',
                'start' => '09:00:00',
                'end' => '10:35:00',
                'week' => 2,
                'day' => 3
            ],
            [
                'id' => 23,
                'lesson' => 'Анатомия',
                'start' => '10:50:00',
                'end' => '13:15:00',
                'week' => 2,
                'day' => 3
            ],
            [
                'id' => 24,
                'lesson' => 'Мед. Химия',
                'start' => '14:30:00',
                'end' => '16:05:00',
                'week' => 2,
                'day' => 3
            ],
            [
                'id' => 25,
                'lesson' => 'Иностранный язык',
                'start' => '09:00:00',
                'end' => '10:35:00',
                'week' => 2,
                'day' => 4
            ],
            [
                'id' => 26,
                'lesson' => 'Биофизика',
                'start' => '10:50:00',
                'end' => '12:25:00',
                'week' => 2,
                'day' => 4
            ],
            [
                'id' => 27,
                'lesson' => 'Мед. Биология',
                'start' => '12:40:00',
                'end' => '14:15:00',
                'week' => 2,
                'day' => 4
            ],
            [
                'id' => 28,
                'lesson' => 'Анатомия',
                'start' => '14:30:00',
                'end' => '16:05:00',
                'week' => 2,
                'day' => 4
            ],
            [
                'id' => 29,
                'lesson' => 'Анатомия',
                'start' => '16:20:00',
                'end' => '17:55:00',
                'week' => 2,
                'day' => 4
            ],
            [
                'id' => 30,
                'lesson' => 'Гистология',
                'start' => '13:30:00',
                'end' => '15:55:00',
                'week' => 2,
                'day' => 5
            ]
        ]);
    }
}
